index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-17 Wed 09:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>waybar Configuration</title>
<meta name="author" content="Kristian Alexander P" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">waybar Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf90f910">waybar</a>
<ul>
<li><a href="#org9f884d2"><code>~/.config/waybar/config</code></a>
<ul>
<li><a href="#org08c20ef">General</a></li>
<li><a href="#org8d77aab">Left Modules</a></li>
<li><a href="#orgd4e50d5">Center Modules</a></li>
<li><a href="#org4db3f98">Right Modules</a></li>
<li><a href="#orgbd5061f">Modules Configuration</a></li>
</ul>
</li>
<li><a href="#org404005d"><code>~/.config/waybar/style.css</code></a>
<ul>
<li><a href="#orge99a152">definitions</a></li>
<li><a href="#org05581a6">global</a></li>
<li><a href="#org1e8ba71">keyframes</a></li>
<li><a href="#org28a8748">window</a></li>
<li><a href="#org38eb16e">button</a></li>
<li><a href="#orgbb912eb">tooltip</a></li>
<li><a href="#org05c4728">modules</a></li>
<li><a href="#org8307758">workspaces</a></li>
<li><a href="#org98f5abe">mode</a></li>
<li><a href="#org9e05ccd">submap</a></li>
<li><a href="#orgaea771a">tray</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgf90f910" class="outline-2">
<h2 id="orgf90f910">waybar</h2>
<div class="outline-text-2" id="text-orgf90f910">
</div>
<div id="outline-container-org9f884d2" class="outline-3">
<h3 id="org9f884d2"><code>~/.config/waybar/config</code></h3>
<div class="outline-text-3" id="text-org9f884d2">
</div>
<div id="outline-container-org08c20ef" class="outline-4">
<h4 id="org08c20ef">General</h4>
<div class="outline-text-4" id="text-org08c20ef">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"layer"</span>: <span style="color: #bc8f8f;">"top"</span>, <span style="color: #b22222;">// </span><span style="color: #b22222;">Waybar at top layer
</span><span style="color: #bc8f8f;">"output"</span>: [<span style="color: #bc8f8f;">"eDP-1"</span>, <span style="color: #bc8f8f;">"DP-1"</span>, <span style="color: #bc8f8f;">"DP-2"</span>, <span style="color: #bc8f8f;">"DP-3"</span>, <span style="color: #bc8f8f;">"DP-4"</span>, <span style="color: #bc8f8f;">"DP-5"</span>, <span style="color: #bc8f8f;">"HDMI-A-1"</span>],
<span style="color: #bc8f8f;">"position"</span>: <span style="color: #bc8f8f;">"top"</span>, <span style="color: #b22222;">// </span><span style="color: #b22222;">Waybar position (top|bottom|left|right)
</span><span style="color: #b22222;">//</span><span style="color: #b22222;">"height": 34, // Waybar height (to be removed for auto height)
</span><span style="color: #b22222;">// </span><span style="color: #b22222;">"width": 1280, // Waybar width
</span><span style="color: #bc8f8f;">"spacing"</span>: 4, <span style="color: #b22222;">// </span><span style="color: #b22222;">Gaps between modules (4px)
</span><span style="color: #b22222;">//</span><span style="color: #b22222;">"start_hidden": "true",
</span><span style="color: #b22222;">// </span><span style="color: #b22222;">Choose the order of the modules</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8d77aab" class="outline-4">
<h4 id="org8d77aab">Left Modules</h4>
<div class="outline-text-4" id="text-org8d77aab">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"modules-left"</span>: [
  <span style="color: #bc8f8f;">"custom/launcher"</span>,
  <span style="color: #bc8f8f;">"hyprland/workspaces"</span>,
  <span style="color: #bc8f8f;">"hyprland/submap"</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"mpris"
</span>  <span style="color: #b22222;">// </span><span style="color: #b22222;">"custom/media"
</span>],
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd4e50d5" class="outline-4">
<h4 id="orgd4e50d5">Center Modules</h4>
<div class="outline-text-4" id="text-orgd4e50d5">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"modules-center"</span>: [
  <span style="color: #bc8f8f;">"hyprland/window"</span>
],
</pre>
</div>
</div>
</div>
<div id="outline-container-org4db3f98" class="outline-4">
<h4 id="org4db3f98">Right Modules</h4>
<div class="outline-text-4" id="text-org4db3f98">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"modules-right"</span>: [
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"mpd",
</span>  <span style="color: #b22222;">// </span><span style="color: #b22222;">"idle_inhibitor",
</span>  <span style="color: #bc8f8f;">"backlight"</span>,
  <span style="color: #bc8f8f;">"pulseaudio"</span>,
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"wireplumber",
</span>  <span style="color: #bc8f8f;">"network"</span>,
  <span style="color: #bc8f8f;">"cpu"</span>,
  <span style="color: #bc8f8f;">"memory"</span>,
  <span style="color: #bc8f8f;">"temperature"</span>,
  <span style="color: #bc8f8f;">"keyboard-state"</span>,
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"hyprland/language",
</span>  <span style="color: #bc8f8f;">"battery"</span>,
  <span style="color: #bc8f8f;">"custom/pacman"</span>,
  <span style="color: #bc8f8f;">"clock#date"</span>,
  <span style="color: #bc8f8f;">"clock#time"</span>,
  <span style="color: #bc8f8f;">"wireplumber"</span>,
  <span style="color: #bc8f8f;">"tray"</span>,
  <span style="color: #bc8f8f;">"custom/power"</span>
],
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbd5061f" class="outline-4">
<h4 id="orgbd5061f">Modules Configuration</h4>
<div class="outline-text-4" id="text-orgbd5061f">
</div>
<ul class="org-ul">
<li><a id="orgfacdd0b"></a>mpris<br />
<div class="outline-text-5" id="text-orgfacdd0b">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"mpris"</span>: {
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{player_icon} {title}"</span>,
  <span style="color: #bc8f8f;">"format-paused"</span>: <span style="color: #bc8f8f;">"{status_icon} &lt;i&gt;{title}&lt;/i&gt;"</span>,
  <span style="color: #bc8f8f;">"player-icons"</span>: {
    <span style="color: #bc8f8f;">"default"</span>: <span style="color: #bc8f8f;">"&#9654;"</span>,
    <span style="color: #bc8f8f;">"mpv"</span>: <span style="color: #bc8f8f;">"&#127925;"</span>
  },
  <span style="color: #bc8f8f;">"status-icons"</span>: {
    <span style="color: #bc8f8f;">"paused"</span>: <span style="color: #bc8f8f;">"&#9208;"</span>
  },
},
</pre>
</div>
</div>
</li>
<li><a id="org6c04d2d"></a>backlight<br />
<div class="outline-text-5" id="text-org6c04d2d">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"backlight"</span>: {
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"&#61829; {percent}%"</span>,
  <span style="color: #bc8f8f;">"interval"</span>: 2,
  <span style="color: #bc8f8f;">"on-scroll-up"</span>: <span style="color: #bc8f8f;">"brightnessctl set +1%"</span>,
  <span style="color: #bc8f8f;">"on-scroll-down"</span>: <span style="color: #bc8f8f;">"brightnessctl set 1%-"</span>
},
</pre>
</div>
</div>
</li>
<li><a id="orgba02cbd"></a>hyprland/workspaces<br />
<div class="outline-text-5" id="text-orgba02cbd">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"hyprland/workspaces"</span>: {
  <span style="color: #b22222;">//</span><span style="color: #b22222;">"num-tags": 6,
</span>  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{id}"</span>,
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"format-icons": {
</span>  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"1": "&#59285;",
</span>  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"2": "&#60100;",
</span>  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"3": "&#984479;",
</span>  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"4": "&#986811;",
</span>  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"5": "&#983572;",
</span>  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"6": "&#985489;",
</span>  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"7": "&#61723;",
</span>  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"8": "&#984148;",
</span>  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"9": "&#61786;",
</span>  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"10": "&#62770;"
</span>  <span style="color: #b22222;">// </span><span style="color: #b22222;">},
</span>  <span style="color: #bc8f8f;">"active-only"</span>: <span style="color: #5f9ea0;">false</span>
},
</pre>
</div>
</div>
</li>
<li><a id="org8415325"></a>hyprland/languages<br />
<div class="outline-text-5" id="text-org8415325">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"hyprland/language"</span>: {
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{}"</span>,
  <span style="color: #bc8f8f;">"format-en"</span>: <span style="color: #bc8f8f;">"en"</span>,
  <span style="color: #bc8f8f;">"keyboard-name"</span>: <span style="color: #bc8f8f;">"at-translated-set-2-keyboard"</span>
},
</pre>
</div>
</div>
</li>
<li><a id="org5d8ee7d"></a>hyprland/window<br />
<div class="outline-text-5" id="text-org5d8ee7d">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"hyprland/window"</span>: {
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{title}"</span>,
  <span style="color: #bc8f8f;">"rewrite"</span>: {
    <span style="color: #bc8f8f;">"(.*) &#8212; Mozilla Firefox"</span>: <span style="color: #bc8f8f;">"&#127758; $1"</span>,
    <span style="color: #bc8f8f;">"(.*) - (GNU Emacs at.*)"</span>: <span style="color: #bc8f8f;">"$1"</span>
  },
  <span style="color: #bc8f8f;">"max-length"</span>: 80,
  <span style="color: #bc8f8f;">"separate-outputs"</span>: <span style="color: #5f9ea0;">true</span>
},
</pre>
</div>
</div>
</li>
<li><a id="org6c87a65"></a>hyprland/submap<br />
<div class="outline-text-5" id="text-org6c87a65">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"hyprland/submap"</span>: {
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{}"</span>,
  <span style="color: #bc8f8f;">"max-length"</span>: 8,
  <span style="color: #bc8f8f;">"tooltip"</span>: <span style="color: #5f9ea0;">false</span>
},
</pre>
</div>
</div>
</li>
<li><a id="orgeae1f7b"></a>keyboard-state<br />
<div class="outline-text-5" id="text-orgeae1f7b">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"keyboard-state"</span>: {
  <span style="color: #bc8f8f;">"numlock"</span>: <span style="color: #5f9ea0;">false</span>,
  <span style="color: #bc8f8f;">"capslock"</span>: <span style="color: #5f9ea0;">true</span>,
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{name} {icon}"</span>,
  <span style="color: #bc8f8f;">"format-icons"</span>: {
    <span style="color: #bc8f8f;">"locked"</span>: <span style="color: #bc8f8f;">"&#61475;"</span>,
    <span style="color: #bc8f8f;">"unlocked"</span>: <span style="color: #bc8f8f;">"&#61596;"</span>
  }
},
</pre>
</div>
</div>
</li>
