index.org
**** pulseaudio
#+begin_src js
  "pulseaudio": {
    // "scroll-step": 1, // %, can be a float
    "format": "{volume}% {icon} {format_source}",
    "format-bluetooth": "{volume}% {icon} {format_source}",
    "format-bluetooth-muted": " {icon} {format_source}",
    "format-muted": " {format_source}",
    "format-source": "{volume}% ",
    "format-source-muted": "",
    "format-icons": {
      "headphone": "",
      "hands-free": "",
      "headset": "",
      "phone": "",
      "portable": "",
      "car": "",
      "default": ["", "", ""]
    },
    "on-click": "wpctl set-mute @DEFAULT_AUDIO_SINK@ toggle"
  },
#+end_src
**** custom/pacman
#+begin_src js
  "custom/pacman": {
    "format": " {} update available",
    "exec": "checkupdates | wc -l",
    "exec-if": "test $(checkupdates | wc -l) -ne 0",
    "interval": 3600,
    "on-click": "checkupdates; pkill -SIGRTMIN+8 waybar"
  },
#+end_src
**** custom/launcher
#+begin_src js
  "custom/launcher":{
    "format": " ",
    "tooltip": false,
    "on-click": "rofi -show drun -theme hyprland-menu",
    "on-click-right": "killall rofi"
  },
#+end_src
**** custom/power
#+begin_src js
  "custom/power":{
    "format": " ",
    "tooltip": false,
    "on-click": "~/.local/bin/rofi-logout hyprland-logout"
  },
#+end_src
**** custom/media
#+begin_src js
  "custom/media": {
    "format": "{icon} {}",
    "return-type": "json",
    "max-length": 40,
    "format-icons": {
      "spotify": "",
      "default": "🎜"
    },
    "escape": true,
    "exec": "$HOME/.config/waybar/mediaplayer.py 2> /dev/null" // Script in resources folder
    // "exec": "$HOME/.config/waybar/mediaplayer.py --player spotify 2> /dev/null" // Filter player based on name
  }
#+end_src
*** End config :noexport:
#+begin_src js
  }
#+end_src
** =~/.config/waybar/style.css=
:PROPERTIES:
:header-args: :tangle .config/waybar/style.css :mkdirp t
:END:
