index.org
*** definitions
#+begin_src css
  /* Nord */
  @define-color background rgba(46, 52, 64, 1);
  @define-color background2 rgba(46, 52, 64, 0.75);
  @define-color cyan rgba(136, 192, 208, 1);
  @define-color cyan2 rgba(136, 192, 208, 0.6);
  @define-color red rgba(191, 97, 106, 1);
  @define-color red2 rgba(191, 97, 106, 0.6);
  @define-color foreground rgba(216, 222, 233, 1);
  @define-color black #161320;
  @define-color green rgba(163, 190, 140, 1);
  @define-color green2 rgba(163, 190, 140, 0.3);
  @define-color yellow rgba(235, 203, 139, 1);
  @define-color yellow2 rgba(235, 203, 139, 0.45);
  @define-color blue rgba(129, 161, 193, 1);
  @define-color blue2 rgba(129, 161, 193, 0.45);
  @define-color magenta rgba(180, 142, 173, 1);
  @define-color magenta2 rgba(180, 142, 173, 0.5);
  @define-color white rgba(229, 233, 240, 1);

  @define-color light #D8DEE9;
  /*@define-color dark @nord_dark_font;*/
  @define-color warning #ebcb8b;
  @define-color critical #BF616A;
  @define-color mode #434C5E;
  /*@define-color workspaces @bg;*/
  /*@define-color workspaces @nord_dark_font;*/
  /*@define-color workspacesfocused #434C5E;*/
  @define-color workspacebutton @white;
  @define-color launcher rgba(94, 129, 172, 1);
  @define-color tray @workspacesfocused;
  @define-color sound #EBCB8B;
  @define-color network #5D7096;
  @define-color memory #546484;
  @define-color cpu rgba(89, 106, 141, 1);
  @define-color keyboard rgba(163, 190, 140, 1);
  @define-color battery rgba(180, 142, 173, 1);
  @define-color temp #4D5C78;
  @define-color layout rgba(94, 129, 172, 1);
  @define-color wireplumber #88c0d0;
  @define-color date rgba(136, 192, 208, 1);
  @define-color time rgba(180, 142, 173, 1);
  @define-color backlight rgba(67, 76, 94, 1);
  @define-color nord_bg rgba(67, 76, 94, 1);
  @define-color nord_bg_blue #546484;
  @define-color nord_light #D8DEE9;
  @define-color nord_light_font #D8DEE9;
  @define-color nord_dark_font #434C5E;
#+end_src
*** global
#+begin_src css
  ,* {
      /* `otf-font-awesome` is required to be installed for icons */
      border: none;
      border-radius: 10px;
      font-family: FontAwesome, JetBrainsMonoNL Nerd Font Mono;
      font-size: 8px;
      min-height: 10px;
  }
#+end_src
*** keyframes
#+begin_src css
  @keyframes blink {
      to {
          background-color: @red;
          color: @cyan;
      }
  }
#+end_src
*** window
#+begin_src css
  window#waybar {
      /* background-color: @background2; */
      background-color: transparent;
      /* border-bottom: 3px solid @cyan; */
      /* color: @white; */
      /* transition-property: background-color; */
      /* transition-duration: .5s; */
  }

  window#waybar.hidden {
      opacity: 0.2;
  }

  window#waybar.empty #window {
      background-color: transparent;
  }

  #window {
      margin-top: 6px;
      margin-left: 8px;
      padding-left: 10px;
      padding-right: 10px;
      border-radius: 10px;
      transition: none;
      color: @black;
      background-color: @white;
      font-size:14px;
      font-weight: bold;
  }
#+end_src
*** button
#+begin_src css
  button {
      /* Use box-shadow instead of border so the text isn't offset */
      /* box-shadow: inset 0 -3px transparent; */
      /* Avoid rounded borders under each button name */
      border: none;
      border-radius: 0;
  }

  /* https://github.com/Alexays/Waybar/wiki/FAQ#the-workspace-buttons-have-a-strange-hover-effect */
  button:hover {
      background: inherit;
      border-top: 2px solid @red;
  }
#+end_src
