index.html
<div id="outline-container-orge99a152" class="outline-4">
<h4 id="orge99a152">definitions</h4>
<div class="outline-text-4" id="text-orge99a152">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #b22222;">/* </span><span style="color: #b22222;">Nord</span><span style="color: #b22222;"> */</span>
<span style="color: #00008b;">@define-color</span> background <span style="color: #ffffff; background-color: #2e3440;">rgba(46, 52, 64, 1)</span>;
<span style="color: #00008b;">@define-color</span> background2 <span style="color: #ffffff; background-color: #2e3440;">rgba(46, 52, 64, 0.75)</span>;
<span style="color: #00008b;">@define-color</span> <span style="color: #000000; background-color: #00ffff;">cyan</span> <span style="color: #000000; background-color: #88c0d0;">rgba(136, 192, 208, 1)</span>;
<span style="color: #00008b;">@define-color</span> cyan2 <span style="color: #000000; background-color: #88c0d0;">rgba(136, 192, 208, 0.6)</span>;
<span style="color: #00008b;">@define-color</span> <span style="color: #ffffff; background-color: #ff0000;">red</span> <span style="color: #ffffff; background-color: #bf616a;">rgba(191, 97, 106, 1)</span>;
<span style="color: #00008b;">@define-color</span> red2 <span style="color: #ffffff; background-color: #bf616a;">rgba(191, 97, 106, 0.6)</span>;
<span style="color: #00008b;">@define-color</span> foreground <span style="color: #000000; background-color: #d8dee9;">rgba(216, 222, 233, 1)</span>;
<span style="color: #00008b;">@define-color</span> <span style="color: #ffffff; background-color: #000000;">black</span> <span style="color: #ffffff; background-color: #161320;">#161320</span>;
<span style="color: #00008b;">@define-color</span> <span style="color: #000000; background-color: #008000;">green</span> <span style="color: #000000; background-color: #a3be8c;">rgba(163, 190, 140, 1)</span>;
<span style="color: #00008b;">@define-color</span> green2 <span style="color: #000000; background-color: #a3be8c;">rgba(163, 190, 140, 0.3)</span>;
<span style="color: #00008b;">@define-color</span> <span style="color: #000000; background-color: #ffff00;">yellow</span> <span style="color: #000000; background-color: #ebcb8b;">rgba(235, 203, 139, 1)</span>;
<span style="color: #00008b;">@define-color</span> yellow2 <span style="color: #000000; background-color: #ebcb8b;">rgba(235, 203, 139, 0.45)</span>;
<span style="color: #00008b;">@define-color</span> <span style="color: #ffffff; background-color: #0000ff;">blue</span> <span style="color: #000000; background-color: #81a1c1;">rgba(129, 161, 193, 1)</span>;
<span style="color: #00008b;">@define-color</span> blue2 <span style="color: #000000; background-color: #81a1c1;">rgba(129, 161, 193, 0.45)</span>;
<span style="color: #00008b;">@define-color</span> <span style="color: #ffffff; background-color: #ff00ff;">magenta</span> <span style="color: #ffffff; background-color: #b48ead;">rgba(180, 142, 173, 1)</span>;
<span style="color: #00008b;">@define-color</span> magenta2 <span style="color: #ffffff; background-color: #b48ead;">rgba(180, 142, 173, 0.5)</span>;
<span style="color: #00008b;">@define-color</span> <span style="color: #000000; background-color: #ffffff;">white</span> <span style="color: #000000; background-color: #e5e9f0;">rgba(229, 233, 240, 1)</span>;

<span style="color: #00008b;">@define-color</span> light <span style="color: #000000; background-color: #D8DEE9;">#D8DEE9</span>;
<span style="color: #b22222;">/*</span><span style="color: #b22222;">@define-color dark @nord_dark_font;</span><span style="color: #b22222;">*/</span>
<span style="color: #00008b;">@define-color</span> warning <span style="color: #000000; background-color: #ebcb8b;">#ebcb8b</span>;
<span style="color: #00008b;">@define-color</span> critical <span style="color: #ffffff; background-color: #BF616A;">#BF616A</span>;
<span style="color: #00008b;">@define-color</span> mode <span style="color: #ffffff; background-color: #434C5E;">#434C5E</span>;
<span style="color: #b22222;">/*</span><span style="color: #b22222;">@define-color workspaces @bg;</span><span style="color: #b22222;">*/</span>
<span style="color: #b22222;">/*</span><span style="color: #b22222;">@define-color workspaces @nord_dark_font;</span><span style="color: #b22222;">*/</span>
<span style="color: #b22222;">/*</span><span style="color: #b22222;">@define-color workspacesfocused #434C5E;</span><span style="color: #b22222;">*/</span>
<span style="color: #00008b;">@define-color</span> workspacebutton <span style="color: #00008b;">@white</span>;
<span style="color: #00008b;">@define-color</span> launcher <span style="color: #000000; background-color: #5e81ac;">rgba(94, 129, 172, 1)</span>;
<span style="color: #00008b;">@define-color</span> tray <span style="color: #00008b;">@workspacesfocused</span>;
<span style="color: #00008b;">@define-color</span> sound <span style="color: #000000; background-color: #EBCB8B;">#EBCB8B</span>;
<span style="color: #00008b;">@define-color</span> network <span style="color: #ffffff; background-color: #5D7096;">#5D7096</span>;
<span style="color: #00008b;">@define-color</span> memory <span style="color: #ffffff; background-color: #546484;">#546484</span>;
<span style="color: #00008b;">@define-color</span> cpu <span style="color: #ffffff; background-color: #596a8d;">rgba(89, 106, 141, 1)</span>;
<span style="color: #00008b;">@define-color</span> keyboard <span style="color: #000000; background-color: #a3be8c;">rgba(163, 190, 140, 1)</span>;
<span style="color: #00008b;">@define-color</span> battery <span style="color: #ffffff; background-color: #b48ead;">rgba(180, 142, 173, 1)</span>;
<span style="color: #00008b;">@define-color</span> temp <span style="color: #ffffff; background-color: #4D5C78;">#4D5C78</span>;
<span style="color: #00008b;">@define-color</span> layout <span style="color: #000000; background-color: #5e81ac;">rgba(94, 129, 172, 1)</span>;
<span style="color: #00008b;">@define-color</span> wireplumber <span style="color: #000000; background-color: #88c0d0;">#88c0d0</span>;
<span style="color: #00008b;">@define-color</span> date <span style="color: #000000; background-color: #88c0d0;">rgba(136, 192, 208, 1)</span>;
<span style="color: #00008b;">@define-color</span> time <span style="color: #ffffff; background-color: #b48ead;">rgba(180, 142, 173, 1)</span>;
<span style="color: #00008b;">@define-color</span> backlight <span style="color: #ffffff; background-color: #434c5e;">rgba(67, 76, 94, 1)</span>;
<span style="color: #00008b;">@define-color</span> nord_bg <span style="color: #ffffff; background-color: #434c5e;">rgba(67, 76, 94, 1)</span>;
<span style="color: #00008b;">@define-color</span> nord_bg_blue <span style="color: #ffffff; background-color: #546484;">#546484</span>;
<span style="color: #00008b;">@define-color</span> nord_light <span style="color: #000000; background-color: #D8DEE9;">#D8DEE9</span>;
<span style="color: #00008b;">@define-color</span> nord_light_font <span style="color: #000000; background-color: #D8DEE9;">#D8DEE9</span>;
<span style="color: #00008b;">@define-color</span> nord_dark_font <span style="color: #ffffff; background-color: #434C5E;">#434C5E</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org05581a6" class="outline-4">
<h4 id="org05581a6">global</h4>
<div class="outline-text-4" id="text-org05581a6">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">*</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">`otf-font-awesome` is required to be installed for icons</span><span style="color: #b22222;"> */</span>
    <span style="color: #4169e1;">border</span>: none;
    <span style="color: #4169e1;">border-radius</span>: 10px;
    <span style="color: #4169e1;">font-family</span>: FontAwesome, JetBrainsMonoNL Nerd Font Mono;
    <span style="color: #4169e1;">font-size</span>: 8px;
    <span style="color: #4169e1;">min-height</span>: 10px;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org1e8ba71" class="outline-4">
<h4 id="org1e8ba71">keyframes</h4>
<div class="outline-text-4" id="text-org1e8ba71">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #00008b;">@keyframes</span> blink {
    <span style="color: #0000ff;">to</span> {
        <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@red</span>;
        <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@cyan</span>;
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org28a8748" class="outline-4">
<h4 id="org28a8748">window</h4>
<div class="outline-text-4" id="text-org28a8748">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">window#waybar</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">background-color: @background2;</span><span style="color: #b22222;"> */</span>
    <span style="color: #4169e1;">background-color</span>: transparent;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">border-bottom: 3px solid @cyan;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @white;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">transition-property: background-color;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">transition-duration: .5s;</span><span style="color: #b22222;"> */</span>
}

<span style="color: #0000ff;">window#waybar.hidden</span> {
    <span style="color: #4169e1;">opacity</span>: 0.2;
}

<span style="color: #0000ff;">window#waybar.empty #window</span> {
    <span style="color: #4169e1;">background-color</span>: transparent;
}

<span style="color: #0000ff;">#window</span> {
    <span style="color: #4169e1;">margin-top</span>: 6px;
    <span style="color: #4169e1;">margin-left</span>: 8px;
    <span style="color: #4169e1;">padding-left</span>: 10px;
    <span style="color: #4169e1;">padding-right</span>: 10px;
    <span style="color: #4169e1;">border-radius</span>: 10px;
    <span style="color: #4169e1;">transition</span>: none;
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@white</span>;
    <span style="color: #4169e1;">font-size</span>:14px;
    <span style="color: #4169e1;">font-weight</span>: bold;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org38eb16e" class="outline-4">
<h4 id="org38eb16e">button</h4>
<div class="outline-text-4" id="text-org38eb16e">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">button</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Use box-shadow instead of border so the text isn't offset</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">box-shadow: inset 0 -3px transparent;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Avoid rounded borders under each button name</span><span style="color: #b22222;"> */</span>
    <span style="color: #4169e1;">border</span>: none;
    <span style="color: #4169e1;">border-radius</span>: 0;
}

<span style="color: #b22222;">/* </span><span style="color: #b22222;">https://github.com/Alexays/Waybar/wiki/FAQ#the-workspace-buttons-have-a-strange-hover-effect</span><span style="color: #b22222;"> */</span>
<span style="color: #0000ff;">button:hover</span> {
    <span style="color: #4169e1;">background</span>: inherit;
    <span style="color: #4169e1;">border-top</span>: 2px solid <span style="color: #00008b;">@red</span>;
}
</pre>
</div>
</div>
</div>
