index.org
*** tooltip
#+begin_src css
  tooltip {
      background: @background;
      border: 1px solid @cyan;
  }

  tooltip label {
      /* color: @white; */
  }

  label:focus {
      background-color: @background;
  }
#+end_src
*** modules
**** cpu
#+begin_src css
  #cpu {
  	margin-top: 6px;
  	margin-left: 8px;
  	padding-left: 10px;
  	margin-bottom: 0px;
  	padding-right: 10px;
  	border-radius: 10px;
  	transition: none;
  	color: @black;
  	background: @cyan2;
  }
#+end_src
**** memory
#+begin_src css
  #memory {
  	margin-top: 6px;
  	margin-left: 8px;
  	padding-left: 10px;
  	margin-bottom: 0px;
  	padding-right: 10px;
  	border-radius: 10px;
  	transition: none;
  	color: @black;
  	background: @magenta;
  }
#+end_src
**** keyboard-state
#+begin_src css
  #keyboard-state {
    	margin-top: 6px;
    	margin-left: 8px;
    	padding-left: 10px;
    	margin-bottom: 0px;
    	padding-right: 10px;
    	border-radius: 10px;
    	transition: none;
    	color: @black;
    	background: @magenta;
  }
#+end_src
**** temperature
#+begin_src css
  #temperature {
    	margin-top: 6px;
    	margin-left: 8px;
    	padding-left: 10px;
    	margin-bottom: 0px;
    	padding-right: 10px;
    	border-radius: 10px;
    	transition: none;
    	color: @black;
    	background: @red;
  }
#+end_src
**** modules-left
#+begin_src css :tangle no
  .modules-left > widget:first-child > #workspaces {
      margin-left: 0;
  }
#+end_src
**** modules-right
#+begin_src css :tangle no
  .modules-right > widget:last-child > #workspaces {
      margin-right: 0;
  }
#+end_src
**** mpris
#+begin_src css
  #mpris {
      /* padding: 0 4px; */
      /* font-size: 9px; */
      /* color: @warning; */
  	margin-top: 6px;
  	margin-left: 8px;
  	padding-left: 10px;
  	padding-right: 10px;
  	margin-bottom: 0px;
  	border-radius: 10px;
  	transition: none;
  	color: @black;
  	background: @blue;
  }
#+end_src
**** idle_inhibitor
#+begin_src css
  #idle_inhibitor {
      color: @blue;
  }

  #idle_inhibitor.activated {
      color: @black;
  }
#+end_src
**** backlight
#+begin_src css
  #backlight{
      /* color: @yellow; */
  	margin-top: 6px;
  	margin-left: 8px;
  	padding-left: 10px;
  	padding-right: 10px;
  	margin-bottom: 0px;
  	border-radius: 10px;
  	transition: none;
  	color: @black;
  	background: @yellow;
  }
#+end_src
**** pulseaudio
#+begin_src css
  #pulseaudio {
      /* background-color: @magenta2; */
      /* color: @wireplumber; */
  	margin-top: 6px;
  	margin-left: 8px;
  	padding-left: 10px;
  	padding-right: 10px;
  	margin-bottom: 0px;
  	border-radius: 10px;
  	transition: none;
  	color: @black;
  	background: @blue;
  }
#+end_src
**** wireplumber
#+begin_src css
  #wireplumber {
      /* background-color: @magenta2; */
  	margin-top: 6px;
  	margin-left: 8px;
  	padding-left: 10px;
  	padding-right: 10px;
  	margin-bottom: 0px;
  	border-radius: 10px;
  	transition: none;
  	color: @black;
  	background: @blue;
  }
#+end_src
**** keyboard-state
#+begin_src css
  #keyboard-state {
      background: @green;
      color: @black;
  }
#+end_src
