index.html
<div id="outline-container-orgbb912eb" class="outline-4">
<h4 id="orgbb912eb">tooltip</h4>
<div class="outline-text-4" id="text-orgbb912eb">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">tooltip</span> {
    <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@background</span>;
    <span style="color: #4169e1;">border</span>: 1px solid <span style="color: #00008b;">@cyan</span>;
}

<span style="color: #0000ff;">tooltip label</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @white;</span><span style="color: #b22222;"> */</span>
}

<span style="color: #0000ff;">label:focus</span> {
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@background</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org05c4728" class="outline-4">
<h4 id="org05c4728">modules</h4>
<div class="outline-text-4" id="text-org05c4728">
</div>
<ul class="org-ul">
<li><a id="orgc494ef0"></a>cpu<br />
<div class="outline-text-5" id="text-orgc494ef0">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#cpu</span> {
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@cyan2</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="orgb37fab0"></a>memory<br />
<div class="outline-text-5" id="text-orgb37fab0">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#memory</span> {
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@magenta</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="orgd345301"></a>keyboard-state<br />
<div class="outline-text-5" id="text-orgd345301">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#keyboard-state</span> {
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@magenta</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="orgedf19ea"></a>temperature<br />
<div class="outline-text-5" id="text-orgedf19ea">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#temperature</span> {
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@red</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="org2d9968e"></a>modules-left<br />
<div class="outline-text-5" id="text-org2d9968e">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">.modules-left &gt; widget:first-child &gt; #workspaces</span> {
    <span style="color: #4169e1;">margin-left</span>: 0;
}
</pre>
</div>
</div>
</li>
<li><a id="org5d4ebc3"></a>modules-right<br />
<div class="outline-text-5" id="text-org5d4ebc3">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">.modules-right &gt; widget:last-child &gt; #workspaces</span> {
    <span style="color: #4169e1;">margin-right</span>: 0;
}
</pre>
</div>
</div>
</li>
<li><a id="org9d060fb"></a>mpris<br />
<div class="outline-text-5" id="text-org9d060fb">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#mpris</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">padding: 0 4px;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">font-size: 9px;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @warning;</span><span style="color: #b22222;"> */</span>
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@blue</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="orge5b015a"></a>idle_inhibitor<br />
<div class="outline-text-5" id="text-orge5b015a">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#idle_inhibitor</span> {
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@blue</span>;
}

<span style="color: #0000ff;">#idle_inhibitor.activated</span> {
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
}
</pre>
</div>
</div>
</li>
