index.org
**** battery
#+begin_src css
  #battery {
      /* color: @battery; */
      /* background-color: @yellow2; */
  	margin-top: 6px;
  	margin-left: 8px;
  	padding-left: 10px;
  	padding-right: 10px;
  	margin-bottom: 0px;
  	border-radius: 10px;
  	transition: none;
  	color: @black;
  	background: @magenta;
  }

  #battery.charging, #battery.plugged {
      /* color: @yellow; */
      /* background-color: @background; */
  	color: @black;
      background-color: @magenta;
  }

  /* #battery.warning:not(.charging) { */
  /*     /\* background: @red; *\/ */
  /*     /\* color: @white; *\/ */
  /*     animation-name: blink; */
  /*     animation-duration: 0.5s; */
  /*     animation-timing-function: steps(12); */
  /*     animation-iteration-count: infinite; */
  /*     animation-direction: alternate; */
  /* } */

  #battery.critical:not(.charging) {
      /* background-color: @red; */
      /* color: @white; */
      /* animation-name: blink; */
      /* animation-duration: 0.5s; */
      /* animation-timing-function: linear; */
      /* animation-iteration-count: infinite; */
      /* animation-direction: alternate; */
      background-color: @magenta;
      color: @black;
      animation-name: blink;
      animation-duration: 0.5s;
      animation-timing-function: linear;
      animation-iteration-count: infinite;
      animation-direction: alternate;
  }
#+end_src
**** custom/pacman
#+begin_src css
  #custom-pacman {
      /* color: @black; */
      /* background-color: @green2; */
  	margin-top: 6px;
  	margin-left: 8px;
  	padding-left: 10px;
  	padding-right: 10px;
  	margin-bottom: 0px;
  	border-radius: 10px;
  	transition: none;
  	color: @black;
  	background: @yellow;
  }
#+end_src
**** clock
#+begin_src css
  #clock.date {
      /* color: @date; */
      /* background-color: @magenta2; */
  	margin-top: 6px;
  	margin-left: 8px;
  	padding-left: 10px;
  	padding-right: 10px;
  	margin-bottom: 0px;
  	border-radius: 10px;
  	transition: none;
  	color: @black;
  	background: @green;
  }

  #clock.time {
      /* color: @time; */
  	margin-top: 6px;
  	margin-left: 8px;
  	padding-left: 10px;
  	padding-right: 10px;
  	margin-bottom: 0px;
  	border-radius: 10px;
  	transition: none;
  	color: @black;
  	background: @yellow;
  }
#+end_src
