index.org
**** network
#+begin_src css
  #network {
      /* color: @network; */
  	margin-top: 6px;
  	margin-left: 8px;
  	padding-left: 10px;
  	padding-right: 10px;
  	margin-bottom: 0px;
  	border-radius: 10px;
  	transition: none;
  	color: @black;
  	background: @magenta;
  }

  #network.wifi {
  	color: @black;
      background: @yellow;
  }

  #network.ethernet {
  	color: @black;
      background: @blue;
  }

  #network.linked {
  	color: @black;
      background: @green;
  }

  #network.disconnected {
      color: @red;
      background: @black;
  }
#+end_src
**** custom-launcher
#+begin_src css
  #custom-launcher {
  	font-size: 24px;
  	margin-top: 6px;
  	margin-left: 8px;
  	padding-left: 10px;
  	padding-right: 5px;
  	border-radius: 10px;
  	transition: none;
      color: @black;
      background: @blue;
  }
#+end_src
**** custom-power
#+begin_src css
  #custom-power {
    	font-size: 24px;
    	margin-top: 6px;
    	margin-left: 8px;
    	padding-left: 10px;
    	padding-right: 5px;
    	border-radius: 10px;
    	transition: none;
        color: @black;
        background: @blue;
  }
#+end_src
*** workspaces
#+begin_src css
  #workspaces {
  	margin-top: 6px;
      margin-left: 12px;
      font-size: 4px;
      margin-bottom: 0px;
      border-radius: 10px;
      background: @green;
      transition: none;
  }

  #workspaces button {
      /* color: @nord_light; */
      /* padding: 0 4px; */
      /* color: @workspacebutton; */
      /* font-size: 14px; */
      /* font-weight: bold; */
  	transition: none;
  	color: @black;
  	background: transparent;
  	font-size: 16px;
  	border-radius: 2px;
  }

  #workspaces button.occupied {
  	transition: none;
  	color: @blue;
  	background: transparent;
  	font-size: 4px;
  }

  #workspaces button.empty {
      color: @cyan;
  }

  #workspaces button.active {
      font-weight: bold;
      color: @white;
  }

  #workspaces button:hover {
  	transition: none;
  	/* box-shadow: inherit; */
  	/* text-shadow: inherit; */
  	color: @yellow;
      /* border-color: @red; */
  }

  #workspaces button.focused {
      /* background-color: @black; */
      /* color: @red; */
      /* border-top: 2px solid @red; */
  	color: @green;
      /* border-top: 2px solid @green; */
      /* border-bottom: 2px solid @green; */
  }

  #workspaces button.focused:hover {
      color: @red;
  }

  #workspaces button.urgent {
      background-color: @red;
  }
#+end_src
*** mode
#+begin_src css :tangle no
  #mode {
      color: @black;
  }
#+end_src
*** submap
#+begin_src css :tangle no
  #submap {
      color: @yellow;
  }
#+end_src
*** tray
#+begin_src css
  #tray {
  	margin-top: 6px;
  	margin-left: 8px;
  	padding-left: 10px;
  	padding-right: 10px;
  	margin-bottom: 0px;
  	border-radius: 10px;
  	transition: none;
  	color: @white;
  	background: @blue;
  }

  #tray > .passive {
      -gtk-icon-effect: dim;
  }

  #tray > .needs-attention {
      -gtk-icon-effect: highlight;
      background-color: @red;
  }
#+end_src
