index.html
<li><a id="org3e69509"></a>clock<br />
<div class="outline-text-5" id="text-org3e69509">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#clock.date</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @date;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">background-color: @magenta2;</span><span style="color: #b22222;"> */</span>
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@green</span>;
}

<span style="color: #0000ff;">#clock.time</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @time;</span><span style="color: #b22222;"> */</span>
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@yellow</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="org9656d8a"></a>network<br />
<div class="outline-text-5" id="text-org9656d8a">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#network</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @network;</span><span style="color: #b22222;"> */</span>
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@magenta</span>;
}

<span style="color: #0000ff;">#network.wifi</span> {
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
    <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@yellow</span>;
}

<span style="color: #0000ff;">#network.ethernet</span> {
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
    <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@blue</span>;
}

<span style="color: #0000ff;">#network.linked</span> {
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
    <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@green</span>;
}

<span style="color: #0000ff;">#network.disconnected</span> {
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@red</span>;
    <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@black</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="org75cc4ff"></a>custom-launcher<br />
<div class="outline-text-5" id="text-org75cc4ff">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#custom-launcher</span> {
      <span style="color: #4169e1;">font-size</span>: 24px;
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">padding-right</span>: 5px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
    <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@blue</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="org7c43d53"></a>custom-power<br />
<div class="outline-text-5" id="text-org7c43d53">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#custom-power</span> {
      <span style="color: #4169e1;">font-size</span>: 24px;
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">padding-right</span>: 5px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@blue</span>;
}
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org8307758" class="outline-4">
<h4 id="org8307758">workspaces</h4>
<div class="outline-text-4" id="text-org8307758">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#workspaces</span> {
      <span style="color: #4169e1;">margin-top</span>: 6px;
    <span style="color: #4169e1;">margin-left</span>: 12px;
    <span style="color: #4169e1;">font-size</span>: 4px;
    <span style="color: #4169e1;">margin-bottom</span>: 0px;
    <span style="color: #4169e1;">border-radius</span>: 10px;
    <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@green</span>;
    <span style="color: #4169e1;">transition</span>: none;
}

<span style="color: #0000ff;">#workspaces button</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @nord_light;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">padding: 0 4px;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @workspacebutton;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">font-size: 14px;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">font-weight: bold;</span><span style="color: #b22222;"> */</span>
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: transparent;
      <span style="color: #4169e1;">font-size</span>: 16px;
      <span style="color: #4169e1;">border-radius</span>: 2px;
}

<span style="color: #0000ff;">#workspaces button.occupied</span> {
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@blue</span>;
      <span style="color: #4169e1;">background</span>: transparent;
      <span style="color: #4169e1;">font-size</span>: 4px;
}

<span style="color: #0000ff;">#workspaces button.empty</span> {
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@cyan</span>;
}

<span style="color: #0000ff;">#workspaces button.active</span> {
    <span style="color: #4169e1;">font-weight</span>: bold;
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@white</span>;
}

<span style="color: #0000ff;">#workspaces button:hover</span> {
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #b22222;">/* </span><span style="color: #b22222;">box-shadow: inherit;</span><span style="color: #b22222;"> */</span>
      <span style="color: #b22222;">/* </span><span style="color: #b22222;">text-shadow: inherit;</span><span style="color: #b22222;"> */</span>
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@yellow</span>;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">border-color: @red;</span><span style="color: #b22222;"> */</span>
}

<span style="color: #0000ff;">#workspaces button.focused</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">background-color: @black;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @red;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">border-top: 2px solid @red;</span><span style="color: #b22222;"> */</span>
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@green</span>;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">border-top: 2px solid @green;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">border-bottom: 2px solid @green;</span><span style="color: #b22222;"> */</span>
}

<span style="color: #0000ff;">#workspaces button.focused:hover</span> {
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@red</span>;
}

<span style="color: #0000ff;">#workspaces button.urgent</span> {
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@red</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org98f5abe" class="outline-4">
<h4 id="org98f5abe">mode</h4>
<div class="outline-text-4" id="text-org98f5abe">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#mode</span> {
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org9e05ccd" class="outline-4">
<h4 id="org9e05ccd">submap</h4>
<div class="outline-text-4" id="text-org9e05ccd">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#submap</span> {
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@yellow</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaea771a" class="outline-4">
<h4 id="orgaea771a">tray</h4>
<div class="outline-text-4" id="text-orgaea771a">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#tray</span> {
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@white</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@blue</span>;
}

<span style="color: #0000ff;">#tray &gt; .passive</span> {
    -gtk-icon-effect: dim;
}

<span style="color: #0000ff;">#tray &gt; .needs-attention</span> {
    -gtk-icon-effect: highlight;
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@red</span>;
}
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-09-17 Wed 00:00</p>
<p class="author">Author: Kristian Alexander P</p>
<p class="date">Created: 2025-09-17 Wed 09:48</p>
</div>
</body>
</html>
